Tekla Open API Reference for Tekla Structures 2025
DrawingCoordinateConverter.Convert Method (ViewBase, ViewBase, Point)
 Converts one coordinate point from one view's coordinate system to another view's coordinate system.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Point Convert(
	ViewBase fromView,
	ViewBase toView,
	Point point
)
Public Shared Function Convert (
	fromView As ViewBase,
	toView As ViewBase,
	point As Point
) As Point
Parameters
fromView
Type: Tekla.Structures.Drawing.ViewBase
The source view.
toView
Type: Tekla.Structures.Drawing.ViewBase
The target view.
point
Type: Tekla.Structures.Geometry3d.Point
The point to be converted.
Return Value
Type: Point
The converted point.
See Also
Reference
DrawingCoordinateConverter Class
Convert Overload
Tekla.Structures.Drawing.Tools Namespace